In [ ]:
# 데이터프레임 생성하기

In [1]:
import pandas as pd

In [3]:
friend_dict_dict = [
    {'name' : 'john', 'age': 25, 'job' : 'student'},
    {'name' : 'Nate', 'age': 30, 'job' : 'teacher'}   
    ]

In [5]:
df = pd.DataFrame(friend_dict_dict) #dictionary를 dataframe으로 생성

In [6]:
df #key의 값 순서가 뒤죽박죽으로 생성됨

   age      job  name
0   25  student  john
1   30  teacher  Nate

In [7]:
df = df[['name', 'age', 'job']] #key의 값을 순서대로 만들어줌

In [8]:
df

   name  age      job
0  john   25  student
1  Nate   30  teacher

In [11]:
# 위의 과정을 하기 번거롭다. 
# 그래서 한방에 해결하기 위해 'ordereddict'사용

In [12]:
from collections import OrderedDict

In [13]:
friend_ordered_dict = OrderedDict(
    [
    ('name', ['john', 'Nate']),
    ('age', [25,30]),
    ('job', ['student', 'teacher'])
    ]
)

In [14]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [15]:
df

   name  age      job
0  john   25  student
1  Nate   30  teacher

In [ ]:
# 그 외 dataframe을 만드는 다양한 방법들

In [17]:
friend_list = [
    ['john', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [19]:
column_name = ['name', 'age', 'job']

In [20]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [21]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

In [22]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20,30]],
    ['job', ['student', 'teacher']]
]

In [24]:
df = pd.DataFrame.from_items(friend_list)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [25]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher